onethinx/Onethinx_Project_Examples/Example_SWV/Onethinx_Creator.cydsn/Generated_Source/PSoC6/UART_1.h
/*******************************************************************************
* File Name: UART_1.h
* Version 2.50
*
* Description:
*  Contains the function prototypes and constants available to the UART
*  user module.
*
* Note:
*
********************************************************************************
* Copyright 2008-2015, Cypress Semiconductor Corporation.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions,
* disclaimers, and limitations in the end user license agreement accompanying
* the software package with which this file was provided.
*******************************************************************************/


#if !defined(CY_UART_UART_1_H)
#define CY_UART_UART_1_H

#include "cyfitter.h"
//#include "project.h"
//#include "CyLib.h" /* For CyEnterCriticalSection() and CyExitCriticalSection() functions */
#include "syslib/cy_syslib.h"  /* For CyEnterCriticalSection() and CyExitCriticalSection() functions */

/***************************************
* Conditional Compilation Parameters
***************************************/

#define UART_1_RX_ENABLED                     (0u)
#define UART_1_TX_ENABLED                     (1u)
#define UART_1_HD_ENABLED                     (0u)
#define UART_1_RX_INTERRUPT_ENABLED           (0u)
#define UART_1_TX_INTERRUPT_ENABLED           (0u)
#define UART_1_INTERNAL_CLOCK_USED            (0u)
#define UART_1_RXHW_ADDRESS_ENABLED           (0u)
#define UART_1_OVER_SAMPLE_COUNT              (8u)
#define UART_1_PARITY_TYPE                    (0u)
#define UART_1_PARITY_TYPE_SW                 (0u)
#define UART_1_BREAK_DETECT                   (0u)
#define UART_1_BREAK_BITS_TX                  (13u)
#define UART_1_BREAK_BITS_RX                  (13u)
#define UART_1_TXCLKGEN_DP                    (1u)
#define UART_1_USE23POLLING                   (1u)
#define UART_1_FLOW_CONTROL                   (0u)
#define UART_1_CLK_FREQ                       (0u)
#define UART_1_TX_BUFFER_SIZE                 (4u)
#define UART_1_RX_BUFFER_SIZE                 (4u)

/* Check to see if required defines such as CY_PSOC5LP are available */
/* They are defined starting with cy_boot v3.0 */
//#if !defined (CY_PSOC5LP)
//    #error Component c_UART_v2_50 requires cy_boot v3.0 or later
//#endif /* (CY_PSOC5LP) */

#if defined(UART_1_BUART_sCR_SyncCtl_CtrlReg__CONTROL_REG)
    #define UART_1_CONTROL_REG_REMOVED            (0u)
#else
    #define UART_1_CONTROL_REG_REMOVED            (1u)
#endif /* End UART_1_BUART_sCR_SyncCtl_CtrlReg__CONTROL_REG */


/***************************************
*      Data Structure Definition
***************************************/

/* Sleep Mode API Support */
typedef struct UART_1_backupStruct_
{
    uint8_t enableState;

    #if(UART_1_CONTROL_REG_REMOVED == 0u)
        uint8_t cr;
    #endif /* End UART_1_CONTROL_REG_REMOVED */

} UART_1_BACKUP_STRUCT;


/***************************************
*       Function Prototypes
***************************************/

void UART_1_Start(void) ;
void UART_1_Stop(void) ;
uint8_t UART_1_ReadControlRegister(void) ;
void UART_1_WriteControlRegister(uint8_t control) ;

void UART_1_Init(void) ;
void UART_1_Enable(void) ;
void UART_1_SaveConfig(void) ;
void UART_1_RestoreConfig(void) ;
void UART_1_Sleep(void) ;
void UART_1_Wakeup(void) ;

/* Only if RX is enabled */
#if( (UART_1_RX_ENABLED) || (UART_1_HD_ENABLED) )

    #if (UART_1_RX_INTERRUPT_ENABLED)
        #define UART_1_EnableRxInt()  CyIntEnable (UART_1_RX_VECT_NUM)
        #define UART_1_DisableRxInt() CyIntDisable(UART_1_RX_VECT_NUM)
        CY_ISR_PROTO(UART_1_RXISR);
    #endif /* UART_1_RX_INTERRUPT_ENABLED */

    void UART_1_SetRxAddressMode(uint8_t addressMode)
                                                           ;
    void UART_1_SetRxAddress1(uint8_t address) ;
    void UART_1_SetRxAddress2(uint8_t address) ;

    void  UART_1_SetRxInterruptMode(uint8_t intSrc) ;
    uint8_t UART_1_ReadRxData(void) ;
    uint8_t UART_1_ReadRxStatus(void) ;
    uint8_t UART_1_GetChar(void) ;
    uint16 UART_1_GetByte(void) ;
    uint8 UART_1_GetRxBufferSize(void)
                                                            ;
    void UART_1_ClearRxBuffer(void) ;

    /* Obsolete functions, defines for backward compatible */
    #define UART_1_GetRxInterruptSource   UART_1_ReadRxStatus

#endif /* End (UART_1_RX_ENABLED) || (UART_1_HD_ENABLED) */

/* Only if TX is enabled */
#if(UART_1_TX_ENABLED || UART_1_HD_ENABLED)

    #if(UART_1_TX_INTERRUPT_ENABLED)
        #define UART_1_EnableTxInt()  CyIntEnable (UART_1_TX_VECT_NUM)
        #define UART_1_DisableTxInt() CyIntDisable(UART_1_TX_VECT_NUM)
        #define UART_1_SetPendingTxInt() CyIntSetPending(UART_1_TX_VECT_NUM)
        #define UART_1_ClearPendingTxInt() CyIntClearPending(UART_1_TX_VECT_NUM)
        CY_ISR_PROTO(UART_1_TXISR);
    #endif /* UART_1_TX_INTERRUPT_ENABLED */

    void UART_1_SetTxInterruptMode(uint8_t intSrc) ;
    void UART_1_WriteTxData(uint8_t txDataByte) ;
    uint8_t UART_1_ReadTxStatus(void) ;
    void UART_1_PutChar(uint8_t txDataByte) ;
    void UART_1_PutString(const char8 string[]) ;
    void UART_1_PutArray(const uint8_t string[], uint8 byteCount)
                                                            ;
    void UART_1_PutCRLF(uint8_t txDataByte) ;
    void UART_1_ClearTxBuffer(void) ;
    void UART_1_SetTxAddressMode(uint8_t addressMode) ;
    void UART_1_SendBreak(uint8_t retMode) ;
    uint8 UART_1_GetTxBufferSize(void)
                                                            ;
    /* Obsolete functions, defines for backward compatible */
    #define UART_1_PutStringConst         UART_1_PutString
    #define UART_1_PutArrayConst          UART_1_PutArray
    #define UART_1_GetTxInterruptSource   UART_1_ReadTxStatus

#endif /* End UART_1_TX_ENABLED || UART_1_HD_ENABLED */

