onethinx/Onethinx_Project_Examples/Example_SWV/Onethinx_Creator.cydsn/Generated_Source/PSoC6/UART_1.h
#if(UART_1_HD_ENABLED)
    void UART_1_LoadRxConfig(void) ;
    void UART_1_LoadTxConfig(void) ;
#endif /* End UART_1_HD_ENABLED */


/* Communication bootloader APIs */
#if defined(CYDEV_BOOTLOADER_IO_COMP) && ((CYDEV_BOOTLOADER_IO_COMP == CyBtldr_UART_1) || \
                                          (CYDEV_BOOTLOADER_IO_COMP == CyBtldr_Custom_Interface))
    /* Physical layer functions */
    void    UART_1_CyBtldrCommStart(void) CYSMALL ;
    void    UART_1_CyBtldrCommStop(void) CYSMALL ;
    void    UART_1_CyBtldrCommReset(void) CYSMALL ;
    cystatus UART_1_CyBtldrCommWrite(const uint8_t pData[], uint16 size, uint16 * count, uint8_t timeOut) CYSMALL
             ;
    cystatus UART_1_CyBtldrCommRead(uint8_t pData[], uint16 size, uint16 * count, uint8_t timeOut) CYSMALL
             ;

    #if (CYDEV_BOOTLOADER_IO_COMP == CyBtldr_UART_1)
        #define CyBtldrCommStart    UART_1_CyBtldrCommStart
        #define CyBtldrCommStop     UART_1_CyBtldrCommStop
        #define CyBtldrCommReset    UART_1_CyBtldrCommReset
        #define CyBtldrCommWrite    UART_1_CyBtldrCommWrite
        #define CyBtldrCommRead     UART_1_CyBtldrCommRead
    #endif  /* (CYDEV_BOOTLOADER_IO_COMP == CyBtldr_UART_1) */

    /* Byte to Byte time out for detecting end of block data from host */
    #define UART_1_BYTE2BYTE_TIME_OUT (25u)
    #define UART_1_PACKET_EOP         (0x17u) /* End of packet defined by bootloader */
    #define UART_1_WAIT_EOP_DELAY     (5u)    /* Additional 5ms to wait for End of packet */
    #define UART_1_BL_CHK_DELAY_MS    (1u)    /* Time Out quantity equal 1mS */

#endif /* CYDEV_BOOTLOADER_IO_COMP */


/***************************************
*          API Constants
***************************************/
/* Parameters for SetTxAddressMode API*/
#define UART_1_SET_SPACE      (0x00u)
#define UART_1_SET_MARK       (0x01u)

/* Status Register definitions */
#if( (UART_1_TX_ENABLED) || (UART_1_HD_ENABLED) )
    #if(UART_1_TX_INTERRUPT_ENABLED)
        #define UART_1_TX_VECT_NUM            (uint8_t)UART_1_TXInternalInterrupt__INTC_NUMBER
        #define UART_1_TX_PRIOR_NUM           (uint8_t)UART_1_TXInternalInterrupt__INTC_PRIOR_NUM
    #endif /* UART_1_TX_INTERRUPT_ENABLED */

    #define UART_1_TX_STS_COMPLETE_SHIFT          (0x00u)
    #define UART_1_TX_STS_FIFO_EMPTY_SHIFT        (0x01u)
    #define UART_1_TX_STS_FIFO_NOT_FULL_SHIFT     (0x03u)
    #if(UART_1_TX_ENABLED)
        #define UART_1_TX_STS_FIFO_FULL_SHIFT     (0x02u)
    #else /* (UART_1_HD_ENABLED) */
        #define UART_1_TX_STS_FIFO_FULL_SHIFT     (0x05u)  /* Needs MD=0 */
    #endif /* (UART_1_TX_ENABLED) */

    #define UART_1_TX_STS_COMPLETE            (uint8_t)(0x01u << UART_1_TX_STS_COMPLETE_SHIFT)
    #define UART_1_TX_STS_FIFO_EMPTY          (uint8_t)(0x01u << UART_1_TX_STS_FIFO_EMPTY_SHIFT)
    #define UART_1_TX_STS_FIFO_FULL           (uint8_t)(0x01u << UART_1_TX_STS_FIFO_FULL_SHIFT)
    #define UART_1_TX_STS_FIFO_NOT_FULL       (uint8_t)(0x01u << UART_1_TX_STS_FIFO_NOT_FULL_SHIFT)
#endif /* End (UART_1_TX_ENABLED) || (UART_1_HD_ENABLED)*/

#if( (UART_1_RX_ENABLED) || (UART_1_HD_ENABLED) )
    #if(UART_1_RX_INTERRUPT_ENABLED)
        #define UART_1_RX_VECT_NUM            (uint8_t)UART_1_RXInternalInterrupt__INTC_NUMBER
        #define UART_1_RX_PRIOR_NUM           (uint8_t)UART_1_RXInternalInterrupt__INTC_PRIOR_NUM
    #endif /* UART_1_RX_INTERRUPT_ENABLED */
    #define UART_1_RX_STS_MRKSPC_SHIFT            (0x00u)
    #define UART_1_RX_STS_BREAK_SHIFT             (0x01u)
    #define UART_1_RX_STS_PAR_ERROR_SHIFT         (0x02u)
    #define UART_1_RX_STS_STOP_ERROR_SHIFT        (0x03u)
    #define UART_1_RX_STS_OVERRUN_SHIFT           (0x04u)
    #define UART_1_RX_STS_FIFO_NOTEMPTY_SHIFT     (0x05u)
    #define UART_1_RX_STS_ADDR_MATCH_SHIFT        (0x06u)
    #define UART_1_RX_STS_SOFT_BUFF_OVER_SHIFT    (0x07u)

    #define UART_1_RX_STS_MRKSPC           (uint8_t)(0x01u << UART_1_RX_STS_MRKSPC_SHIFT)
    #define UART_1_RX_STS_BREAK            (uint8_t)(0x01u << UART_1_RX_STS_BREAK_SHIFT)
    #define UART_1_RX_STS_PAR_ERROR        (uint8_t)(0x01u << UART_1_RX_STS_PAR_ERROR_SHIFT)
    #define UART_1_RX_STS_STOP_ERROR       (uint8_t)(0x01u << UART_1_RX_STS_STOP_ERROR_SHIFT)
    #define UART_1_RX_STS_OVERRUN          (uint8_t)(0x01u << UART_1_RX_STS_OVERRUN_SHIFT)
    #define UART_1_RX_STS_FIFO_NOTEMPTY    (uint8_t)(0x01u << UART_1_RX_STS_FIFO_NOTEMPTY_SHIFT)
    #define UART_1_RX_STS_ADDR_MATCH       (uint8_t)(0x01u << UART_1_RX_STS_ADDR_MATCH_SHIFT)
    #define UART_1_RX_STS_SOFT_BUFF_OVER   (uint8_t)(0x01u << UART_1_RX_STS_SOFT_BUFF_OVER_SHIFT)
    #define UART_1_RX_HW_MASK                     (0x7Fu)
#endif /* End (UART_1_RX_ENABLED) || (UART_1_HD_ENABLED) */

/* Control Register definitions */
#define UART_1_CTRL_HD_SEND_SHIFT                 (0x00u) /* 1 enable TX part in Half Duplex mode */
#define UART_1_CTRL_HD_SEND_BREAK_SHIFT           (0x01u) /* 1 send BREAK signal in Half Duplez mode */
#define UART_1_CTRL_MARK_SHIFT                    (0x02u) /* 1 sets mark, 0 sets space */
#define UART_1_CTRL_PARITY_TYPE0_SHIFT            (0x03u) /* Defines the type of parity implemented */
#define UART_1_CTRL_PARITY_TYPE1_SHIFT            (0x04u) /* Defines the type of parity implemented */
#define UART_1_CTRL_RXADDR_MODE0_SHIFT            (0x05u)
#define UART_1_CTRL_RXADDR_MODE1_SHIFT            (0x06u)
#define UART_1_CTRL_RXADDR_MODE2_SHIFT            (0x07u)

#define UART_1_CTRL_HD_SEND               (uint8_t)(0x01u << UART_1_CTRL_HD_SEND_SHIFT)
#define UART_1_CTRL_HD_SEND_BREAK         (uint8_t)(0x01u << UART_1_CTRL_HD_SEND_BREAK_SHIFT)
#define UART_1_CTRL_MARK                  (uint8_t)(0x01u << UART_1_CTRL_MARK_SHIFT)
#define UART_1_CTRL_PARITY_TYPE_MASK      (uint8_t)(0x03u << UART_1_CTRL_PARITY_TYPE0_SHIFT)
#define UART_1_CTRL_RXADDR_MODE_MASK      (uint8_t)(0x07u << UART_1_CTRL_RXADDR_MODE0_SHIFT)

/* StatusI Register Interrupt Enable Control Bits. As defined by the Register map for the AUX Control Register */
#define UART_1_INT_ENABLE                         (0x10u)

/* Bit Counter (7-bit) Control Register Bit Definitions. As defined by the Register map for the AUX Control Register */
#define UART_1_CNTR_ENABLE                        (0x20u)

/*   Constants for SendBreak() "retMode" parameter  */
#define UART_1_SEND_BREAK                         (0x00u)
#define UART_1_WAIT_FOR_COMPLETE_REINIT           (0x01u)
#define UART_1_REINIT                             (0x02u)
#define UART_1_SEND_WAIT_REINIT                   (0x03u)

#define UART_1_OVER_SAMPLE_8                      (8u)
#define UART_1_OVER_SAMPLE_16                     (16u)

#define UART_1_BIT_CENTER                         (UART_1_OVER_SAMPLE_COUNT - 2u)

#define UART_1_FIFO_LENGTH                        (4u)
#define UART_1_NUMBER_OF_START_BIT                (1u)
#define UART_1_MAX_BYTE_VALUE                     (0xFFu)

/* 8X always for count7 implementation */
#define UART_1_TXBITCTR_BREAKBITS8X   ((UART_1_BREAK_BITS_TX * UART_1_OVER_SAMPLE_8) - 1u)
/* 8X or 16X for DP implementation */
#define UART_1_TXBITCTR_BREAKBITS ((UART_1_BREAK_BITS_TX * UART_1_OVER_SAMPLE_COUNT) - 1u)

