onethinx/Onethinx_Project_Examples/Example_SWV/Onethinx_Creator.cydsn/Generated_Source/PSoC6/UART_1.h
#define UART_1_HALF_BIT_COUNT   \
                            (((UART_1_OVER_SAMPLE_COUNT / 2u) + (UART_1_USE23POLLING * 1u)) - 2u)
#if (UART_1_OVER_SAMPLE_COUNT == UART_1_OVER_SAMPLE_8)
    #define UART_1_HD_TXBITCTR_INIT   (((UART_1_BREAK_BITS_TX + \
                            UART_1_NUMBER_OF_START_BIT) * UART_1_OVER_SAMPLE_COUNT) - 1u)

    /* This parameter is increased on the 2 in 2 out of 3 mode to sample voting in the middle */
    #define UART_1_RXBITCTR_INIT  ((((UART_1_BREAK_BITS_RX + UART_1_NUMBER_OF_START_BIT) \
                            * UART_1_OVER_SAMPLE_COUNT) + UART_1_HALF_BIT_COUNT) - 1u)

#else /* UART_1_OVER_SAMPLE_COUNT == UART_1_OVER_SAMPLE_16 */
    #define UART_1_HD_TXBITCTR_INIT   ((8u * UART_1_OVER_SAMPLE_COUNT) - 1u)
    /* 7bit counter need one more bit for OverSampleCount = 16 */
    #define UART_1_RXBITCTR_INIT      (((7u * UART_1_OVER_SAMPLE_COUNT) - 1u) + \
                                                      UART_1_HALF_BIT_COUNT)
#endif /* End UART_1_OVER_SAMPLE_COUNT */

#define UART_1_HD_RXBITCTR_INIT                   UART_1_RXBITCTR_INIT


/***************************************
* Global variables external identifier
***************************************/

extern uint8_t UART_1_initVar;
#if (UART_1_TX_INTERRUPT_ENABLED && UART_1_TX_ENABLED)
    extern volatile uint8_t UART_1_txBuffer[UART_1_TX_BUFFER_SIZE];
    extern volatile uint8 UART_1_txBufferRead;
    extern uint8 UART_1_txBufferWrite;
#endif /* (UART_1_TX_INTERRUPT_ENABLED && UART_1_TX_ENABLED) */
#if (UART_1_RX_INTERRUPT_ENABLED && (UART_1_RX_ENABLED || UART_1_HD_ENABLED))
    extern uint8_t UART_1_errorStatus;
    extern volatile uint8_t UART_1_rxBuffer[UART_1_RX_BUFFER_SIZE];
    extern volatile uint8 UART_1_rxBufferRead;
    extern volatile uint8 UART_1_rxBufferWrite;
    extern volatile uint8_t UART_1_rxBufferLoopDetect;
    extern volatile uint8_t UART_1_rxBufferOverflow;
    #if (UART_1_RXHW_ADDRESS_ENABLED)
        extern volatile uint8_t UART_1_rxAddressMode;
        extern volatile uint8_t UART_1_rxAddressDetected;
    #endif /* (UART_1_RXHW_ADDRESS_ENABLED) */
#endif /* (UART_1_RX_INTERRUPT_ENABLED && (UART_1_RX_ENABLED || UART_1_HD_ENABLED)) */


/***************************************
* Enumerated Types and Parameters
***************************************/

#define UART_1__B_UART__AM_SW_BYTE_BYTE 1
#define UART_1__B_UART__AM_SW_DETECT_TO_BUFFER 2
#define UART_1__B_UART__AM_HW_BYTE_BY_BYTE 3
#define UART_1__B_UART__AM_HW_DETECT_TO_BUFFER 4
#define UART_1__B_UART__AM_NONE 0

#define UART_1__B_UART__NONE_REVB 0
#define UART_1__B_UART__EVEN_REVB 1
#define UART_1__B_UART__ODD_REVB 2
#define UART_1__B_UART__MARK_SPACE_REVB 3



/***************************************
*    Initial Parameter Constants
***************************************/

/* UART shifts max 8 bits, Mark/Space functionality working if 9 selected */
#define UART_1_NUMBER_OF_DATA_BITS    ((8u > 8u) ? 8u : 8u)
#define UART_1_NUMBER_OF_STOP_BITS    (1u)

#if (UART_1_RXHW_ADDRESS_ENABLED)
    #define UART_1_RX_ADDRESS_MODE    (0u)
    #define UART_1_RX_HW_ADDRESS1     (0u)
    #define UART_1_RX_HW_ADDRESS2     (0u)
#endif /* (UART_1_RXHW_ADDRESS_ENABLED) */

#define UART_1_INIT_RX_INTERRUPTS_MASK \
                                  (uint8_t)((0 << UART_1_RX_STS_FIFO_NOTEMPTY_SHIFT) \
                                        | (0 << UART_1_RX_STS_MRKSPC_SHIFT) \
                                        | (0 << UART_1_RX_STS_ADDR_MATCH_SHIFT) \
                                        | (0 << UART_1_RX_STS_PAR_ERROR_SHIFT) \
                                        | (0 << UART_1_RX_STS_STOP_ERROR_SHIFT) \
                                        | (0 << UART_1_RX_STS_BREAK_SHIFT) \
                                        | (0 << UART_1_RX_STS_OVERRUN_SHIFT))

#define UART_1_INIT_TX_INTERRUPTS_MASK \
                                  (uint8_t)((0 << UART_1_TX_STS_COMPLETE_SHIFT) \
                                        | (0 << UART_1_TX_STS_FIFO_EMPTY_SHIFT) \
                                        | (0 << UART_1_TX_STS_FIFO_FULL_SHIFT) \
                                        | (0 << UART_1_TX_STS_FIFO_NOT_FULL_SHIFT))


/***************************************
*              Registers
***************************************/

#ifdef UART_1_BUART_sCR_SyncCtl_CtrlReg__CONTROL_REG
    #define UART_1_CONTROL_REG \
                            (* (reg8 *) UART_1_BUART_sCR_SyncCtl_CtrlReg__CONTROL_REG )
    #define UART_1_CONTROL_PTR \
                            (  (reg8 *) UART_1_BUART_sCR_SyncCtl_CtrlReg__CONTROL_REG )
#endif /* End UART_1_BUART_sCR_SyncCtl_CtrlReg__CONTROL_REG */

#if(UART_1_TX_ENABLED)
    #define UART_1_TXDATA_REG          (* (reg8 *) UART_1_BUART_sTX_TxShifter_u0__F0_REG)
    #define UART_1_TXDATA_PTR          (  (reg8 *) UART_1_BUART_sTX_TxShifter_u0__F0_REG)
    #define UART_1_TXDATA_AUX_CTL_REG  (* (reg8 *) UART_1_BUART_sTX_TxShifter_u0__DP_AUX_CTL_REG)
    #define UART_1_TXDATA_AUX_CTL_PTR  (  (reg8 *) UART_1_BUART_sTX_TxShifter_u0__DP_AUX_CTL_REG)
    #define UART_1_TXSTATUS_REG        (* (reg8 *) UART_1_BUART_sTX_TxSts__STATUS_REG)
    #define UART_1_TXSTATUS_PTR        (  (reg8 *) UART_1_BUART_sTX_TxSts__STATUS_REG)
    #define UART_1_TXSTATUS_MASK_REG   (* (reg8 *) UART_1_BUART_sTX_TxSts__MASK_REG)
    #define UART_1_TXSTATUS_MASK_PTR   (  (reg8 *) UART_1_BUART_sTX_TxSts__MASK_REG)
    #define UART_1_TXSTATUS_ACTL_REG   (* (reg8 *) UART_1_BUART_sTX_TxSts__STATUS_AUX_CTL_REG)
    #define UART_1_TXSTATUS_ACTL_PTR   (  (reg8 *) UART_1_BUART_sTX_TxSts__STATUS_AUX_CTL_REG)

    /* DP clock */
    #if(UART_1_TXCLKGEN_DP)
        #define UART_1_TXBITCLKGEN_CTR_REG        \
                                        (* (reg8 *) UART_1_BUART_sTX_sCLOCK_TxBitClkGen__D0_REG)
        #define UART_1_TXBITCLKGEN_CTR_PTR        \
                                        (  (reg8 *) UART_1_BUART_sTX_sCLOCK_TxBitClkGen__D0_REG)
        #define UART_1_TXBITCLKTX_COMPLETE_REG    \
                                        (* (reg8 *) UART_1_BUART_sTX_sCLOCK_TxBitClkGen__D1_REG)
        #define UART_1_TXBITCLKTX_COMPLETE_PTR    \
                                        (  (reg8 *) UART_1_BUART_sTX_sCLOCK_TxBitClkGen__D1_REG)
    #else     /* Count7 clock*/
        #define UART_1_TXBITCTR_PERIOD_REG    \
                                        (* (reg8 *) UART_1_BUART_sTX_sCLOCK_TxBitCounter__PERIOD_REG)
        #define UART_1_TXBITCTR_PERIOD_PTR    \
                                        (  (reg8 *) UART_1_BUART_sTX_sCLOCK_TxBitCounter__PERIOD_REG)
        #define UART_1_TXBITCTR_CONTROL_REG   \
                                        (* (reg8 *) UART_1_BUART_sTX_sCLOCK_TxBitCounter__CONTROL_AUX_CTL_REG)
        #define UART_1_TXBITCTR_CONTROL_PTR   \
                                        (  (reg8 *) UART_1_BUART_sTX_sCLOCK_TxBitCounter__CONTROL_AUX_CTL_REG)
        #define UART_1_TXBITCTR_COUNTER_REG   \
                                        (* (reg8 *) UART_1_BUART_sTX_sCLOCK_TxBitCounter__COUNT_REG)
        #define UART_1_TXBITCTR_COUNTER_PTR   \
                                        (  (reg8 *) UART_1_BUART_sTX_sCLOCK_TxBitCounter__COUNT_REG)
    #endif /* UART_1_TXCLKGEN_DP */

#endif /* End UART_1_TX_ENABLED */

